tap "symfony-cli/tap"

brew "antidote"
brew "autojump"
brew "composer"
brew "gh"
brew "glances"
brew "libpq"
brew "lsd"
brew "php"
brew "terminal-notifier"
brew "tldr"
brew "uv"
brew "symfony-cli/tap/symfony-cli", trusted: true

cask "codexbar"
cask "jordanbaird-ice"
cask "keeweb"
