tap "symfony-cli/tap"

brew "act"
brew "actionlint"
brew "antidote"
brew "autojump"
brew "bat"
brew "composer"
brew "ctop"
brew "duf"
brew "dust"
brew "editorconfig-checker"
brew "gh"
brew "git-delta"
brew "gitleaks"
brew "glances"
brew "hadolint"
brew "libpq"
brew "lsd"
brew "lychee"
brew "markdownlint-cli2"
brew "php"
brew "pre-commit"
brew "shellcheck"
brew "terminal-notifier"
brew "tldr"
brew "tokei"
brew "tree"
brew "uv"

brew "symfony-cli/tap/symfony-cli", trusted: true

cask "beekeeper-studio"
cask "codexbar"
cask "jordanbaird-ice"
cask "keeweb"
cask "orbstack"
cask "pearcleaner"
cask "stats"
