tap "symfony-cli/tap"
# Run your GitHub Actions locally
brew "act"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Shell extension to jump to frequently used directories
brew "autojump"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Postgres C API library
brew "libpq"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Top-like interface for container metrics
brew "ctop"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Tool to verify that your files are in harmony with your .editorconfig
brew "editorconfig-checker"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Audit git repos for secrets
brew "gitleaks"
# Alternative to top/htop
brew "glances"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Fast, async, resource-friendly link checker
brew "lychee"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Fast, flexible, config-based cli for linting Markdown/CommonMark files
brew "markdownlint-cli2"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# SMTP command-line test tool
brew "swaks"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Simplified and community-driven man pages
brew "tldr"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Symfony CLI helps Symfony developers manage projects, from local code to remote infrastructure
brew "symfony-cli/tap/symfony-cli", trusted: true
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Menu bar usage monitor for Codex and Claude
cask "codexbar"
# Menu bar manager
cask "jordanbaird-ice"
# Keyboard customiser
cask "karabiner-elements"
# Password manager compatible with KeePass
cask "keeweb"
# Replacement for Docker Desktop
cask "orbstack"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# System monitor for the menu bar
cask "stats"
# Unicode keyboard layout editor
cask "ukelele"
# Configurator of compatible keyboards in real time
cask "vial"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
vscode "anthropic.claude-code"
vscode "avaly.restore-git-branch-tabs-improved"
vscode "bmewburn.vscode-intelephense-client"
vscode "christian-kohler.path-intellisense"
vscode "eamodio.gitlens"
vscode "github.vscode-github-actions"
vscode "hogashi.crontab-syntax-highlight"
vscode "mechatroner.rainbow-csv"
vscode "mehedidracula.php-namespace-resolver"
vscode "mikestead.dotenv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "redhat.vscode-yaml"
vscode "sanderronde.phpstan-vscode"
vscode "whatwedo.twig"
vscode "xdebug.php-debug"
uv "claude-monitor"
