# Oh My Zsh compatibility and libraries
getantidote/use-omz
ohmyzsh/ohmyzsh path:lib

# Oh My Zsh plugins
ohmyzsh/ohmyzsh path:plugins/autojump
ohmyzsh/ohmyzsh path:plugins/command-not-found
ohmyzsh/ohmyzsh path:plugins/git

# Interactive helpers
zsh-users/zsh-autosuggestions
djui/alias-tips

# Prompt
romkatv/powerlevel10k

# Keep syntax highlighting last
zsh-users/zsh-syntax-highlighting
