# Taps

tap "symfony-cli/tap"

# CLI tools

# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Shell extension to jump to frequently used directories
brew "autojump"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Top-like interface for container metrics
brew "ctop"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Alternative to top/htop
brew "glances"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Official tldr client written in Rust
brew "tlrc"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"

# Dev tools

# Run your GitHub Actions locally
brew "act"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Dependency Manager for PHP
brew "composer"
# Tool to verify that your files are in harmony with your .editorconfig
brew "editorconfig-checker"
# GitHub command-line tool
brew "gh"
# Audit git repos for secrets
brew "gitleaks"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Postgres C API library
brew "libpq"
# Fast, async, resource-friendly link checker
brew "lychee"
# Fast, flexible, config-based cli for linting Markdown/CommonMark files
brew "markdownlint-cli2"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# General-purpose scripting language
brew "php"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Symfony CLI helps Symfony developers manage projects, from local code to remote infrastructure
brew "symfony-cli/tap/symfony-cli", trusted: true
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"

# GUI apps

# Productivity launcher — replaces Spotlight with clipboard history, snippets, and window management
cask "raycast"
# Screenshot and screen recording tool with annotations, scrolling capture, and OCR
cask "cleanshot"
# Local-first Markdown note-taking app with a personal vault
cask "obsidian"
# Collaborative workspace for notes, databases, and wikis
cask "notion"
# Open-source image editor for manual retouching and background removal
cask "gimp"
# Claude desktop app by Anthropic
cask "claude"
# Run large language models locally
cask "ollama"
# Open-source API client with collections stored as plain files
cask "bruno"
# Web browser — primary development browser
cask "google-chrome"
# Web browser — cross-browser testing
cask "firefox"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Menu bar usage monitor for Codex and Claude
cask "codexbar"
# Menu bar manager
cask "jordanbaird-ice"
# Password manager compatible with KeePass
cask "keeweb"
# Replacement for Docker Desktop
cask "orbstack"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# System monitor for the menu bar
cask "stats"
# Menu bar app runner — shell scripts become menu bar items with auto-refresh
cask "swiftbar"
# Unicode keyboard layout editor
cask "ukelele"
# Open-source code editor
cask "visual-studio-code"
# Fast and lightweight text editor
cask "sublime-text"
# Rust-based terminal
cask "warp"

# Runtime-managed tools

uv "claude-monitor"
