# Minimal command-line setup.
#
# Keep this profile focused on essential tools needed for shell, Git, and
# project maintenance. Add larger apps and language stacks to the full profile.

# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Audit git repos for secrets
brew "gitleaks"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
